""" Код зі схемами Pydantic для валідації даних та опису моделей, які використовуються у додатку"""
from pydantic import BaseModel, EmailStr
from datetime import date, datetime

class ContactBase(BaseModel):
    """
    Базова схема для контактів, яка містить загальні поля, такі як ім'я, прізвище, email,
    телефон, дата народження та додаткова інформація. Ця схема використовується як основа для
    створення та оновлення контактів. Вона забезпечує валідацію даних та визначає типи полів,
    що допомагає уникнути помилок при обробці даних користувача.
    
    :param first_name: ім'я контакту, яке є обов'язковим полем.
    :type first_name: str
    
    :param last_name: прізвище контакту, яке є обов'язковим полем.
    :type last_name: str
    
    :param email: адреса електронної пошти контакту, яка є обов'язковим полем.
    :type email: EmailStr
    
    :param phone: номер телефону контакту, який є обов'язковим полем.
    :type phone: str
    
    :param birthday: дата народження контакту, яка є обов'язковим полем.
    :type birthday: date
    
    :param extra_info: додаткова інформація про контакт, яка є необов'язковим полем.
    :type extra_info: str | None
    
    """
    first_name: str
    last_name: str
    email: EmailStr
    phone: str
    birthday: date
    extra_info: str | None = None

class ContactCreate(ContactBase):
    """
    Схема для створення контакту, яка успадковує всі поля з ContactBase. Ця схема
    використовується для валідації даних при створенні нового контакту. Вона не містить
    додаткових полів, але може бути розширена в майбутньому, якщо буде потрібно додати
    специфічні поля для процесу створення контакту.
    
    :return: Об'єкт :class:`src.schemas.ContactCreate`
    :rtype: src.schemas.ContactCreate
    
    """
    pass

class ContactUpdate(ContactBase):
    """
    Схема для оновлення контакту, яка успадковує всі поля з ContactBase. Ця схема
    використовується для валідації даних при оновленні існуючого контакту.
    
    :return: Об'єкт :class:`src.schemas.ContactUpdate`
    :rtype: src.schemas.ContactUpdate
    
    """
    pass

class Contact(ContactBase):
    """ 
    Схема для представлення контакту, яка успадковує всі поля з ContactBase. Ця схема
    використовується для відображення даних про контакт у відповідях API.
    
    :param id: унікальний ідентифікатор контакту, який є обов'язковим полем.
    :type id: int
    
    :param user_id: ідентифікатор користувача, який створив контакт, який є обов'язковим полем.
    :type user_id: int
    
    :return: Об'єкт :class:`src.schemas.Contact`
    :rtype: src.schemas.Contact
    
    """
    id: int
    user_id: int
    class Config:
        """
        Конфігурація Pydantic, яка дозволяє створювати об'єкти Contact з атрибутів, а не
        лише з словників. Це корисно, коли дані надходять у вигляді об'єктів, наприклад, з бази
        даних або інших джерел, де дані представлені як атрибути.
        
        """
        from_attributes = True

class UserModel(BaseModel):
    """
    Схема для створення користувача.
    
    :param username: ім'я користувача, яке є обов'язковим полем.
    :type username: str
    
    :param email: адреса електронної пошти користувача, яка є обов'язковим полем.
    :type email: EmailStr
    
    :param password: пароль користувача, який є обов'язковим полем.
    :type password: str
    
    """
    username: str
    email: EmailStr
    password: str

class UserDb(BaseModel):
    """
    Схема для представлення користувача з бази даних. Ця схема містить всі поля, які зберігаються в
    базі даних для користувача, включаючи id, username, email, дату створення, аватар та статус
    підтвердження. Вона використовується для відображення даних про користувача у відповідях API
    та для роботи з даними користувача в додатку.
    
    :param id: унікальний ідентифікатор користувача, який є обов'язковим полем.
    :type id: int
    
    :param username: ім'я користувача, яке є обов'язковим полем.
    :type username: str
    
    :param email: адреса електронної пошти користувача, яка є обов'язковим полем.
    :type email: EmailStr
    
    :param created_at: дата та час створення користувача, які є обов'язковим полем.
    :type created_at: datetime
    
    :param avatar: адреса аватара користувача, яка є необов'язковим полем.
    :type avatar: str | None
    
    :param confirmed: статус підтвердження користувача, який є обов'язковим полем.
    :type confirmed: bool
    
    """
    id: int
    username: str
    email: EmailStr
    created_at: datetime
    avatar: str | None
    confirmed: bool
    class Config:
        """ 
        Конфігурація Pydantic, яка дозволяє створювати об'єкти UserDb з атрибутів, а не лише з
        словників. Це корисно, коли дані надходять у вигляді об'єктів, наприклад, з бази даних або
        інших джерел, де дані представлені як атрибути.
        
        """
        from_attributes = True

class UserResponse(BaseModel):
    """
    Схема для відповіді при створенні користувача. Вона містить дані про створеного користувача та
    додаткове повідомлення про успішне створення. Ця схема використовується для формування
    відповіді API після успішного створення користувача, надаючи клієнту інформацію про нового
    користувача та підтвердження успішної операції.
    
    :param user: дані про створеного користувача, представлені у вигляді об'єкта UserDb.
    :type user: src.schemas.UserDb
    
    :param detail: повідомлення про успішне створення користувача.
    :type detail: str
    
    """
    user: UserDb
    detail: str = "User successfully created"

class TokenModel(BaseModel):
    """
    Схема для представлення токена доступу та оновлення. Вона містить поля для access_token,
    refresh_token та token_type. Ця схема використовується для формування відповіді API після
    успішної аутентифікації користувача, надаючи клієнту необхідні токени для подальшої взаємодії
    з API.
    
    :param access_token: токен доступу, який є обов'язковим полем.
    :type access_token: str
    
    :param refresh_token: токен оновлення, який є обов'язковим полем.
    :type refresh_token: str
    
    :param token_type: тип токена, який є обов'язковим полем.
    :type token_type: str
    
    """
    access_token: str
    refresh_token: str
    token_type: str = "bearer"

class UserLogin(BaseModel):
    """
    Схема для аутентифікації користувача. Вона містить поля для email та password, які є
    обов'язковими для процесу входу користувача. Ця схема використовується для валідації даних
    при аутентифікації користувача, забезпечуючи правильний формат email та наявність пароля.
    Вона допомагає уникнути помилок при обробці даних користувача та забезпечує безпеку процесу
    аутентифікації.
    
    :param email: адреса електронної пошти користувача, яка є обов'язковим полем.
    :type email: EmailStr
    
    :param password: пароль користувача, який є обов'язковим полем.
    :type password: str
    
    """
    email: EmailStr
    password: str

class RefreshRequest(BaseModel):
    """
    Схема для запиту оновлення токена. Вона містить поле refresh_token, яке є обов'язковим для
    процесу оновлення токена. Ця схема використовується для валідації даних при запиті на
    оновлення токена, забезпечуючи наявність refresh_token та правильний формат даних. Вона
    допомагає уникнути помилок при обробці даних користувача та забезпечує безпеку процесу
    оновлення токена.
        
    :param refresh_token: токен оновлення, який є обов'язковим полем.
    :type refresh_token: str
    
    """
    refresh_token: str

class RequestEmail(BaseModel):
    """
    Схема для запиту на відправку листа з підтвердженням реєстрації. Вона містить поле email,
    яке є обов'язковим для процесу відправки листа. Ця схема використовується для валідації даних
    при запиті на відправку листа, забезпечуючи правильний формат email та наявність цього поля.
    Вона допомагає уникнути помилок при обробці даних користувача та забезпечує безпеку процесу
    відправки листа з підтвердженням реєстрації.
    
     :param email: адреса електронної пошти користувача, на яку буде відправлено лист.
     :type email: EmailStr
     
     """
    email: EmailStr


class ResetPasswordRequest(BaseModel):
    """ Схема для запиту на відправку листа для скидання пароля. Вона містить поле email, яке є
    обов'язковим для процесу відправки листа. Ця схема використовується для валідації даних при
    запиті на відправку листа для скидання пароля, забезпечуючи правильний формат email та
    наявність цього поля. Вона допомагає уникнути помилок при обробці даних користувача та
    забезпечує безпеку процесу відправки листа для скидання пароля.
    
    :param email: адреса електронної пошти користувача, на яку буде відправлено лист.
    :type email: EmailStr
    
    """
    email: EmailStr

class ResetPasswordConfirm(BaseModel):
    """
    Схема для підтвердження скидання пароля. Вона містить поле new_password, яке є обов'язковим для
    процесу скидання пароля. Ця схема використовується для валідації даних при підтвердженні
    скидання пароля, забезпечуючи наявність нового пароля та правильний формат даних. Вона
    допомагає уникнути помилок при обробці даних користувача та забезпечує безпеку процесу скидання
    пароля. 
    
    :param new_password: новий пароль користувача.
    :type new_password: str
    
    """
    new_password: str
